testing-sapir-whorf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Testing Sapir-Whorf</title>
<!-- 2015-01-01 Thu 08:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Peter Danenberg" />
<link rel="stylesheet" type="text/css"/ href="daybook.css"><link href='http://fonts.googleapis.com/css?family=Cardo' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Testing Sapir-Whorf</h1>
<blockquote>
<p>
“The language you program with shapes and limits the solutions you
can formulate.”
</p>

<p>
How would one go about testing this hypothesis? —<a href="http://piagetmodeler.tumblr.com/">Michael</a>
</p>
</blockquote>

<p>
Heh: get some Lispers and a C-gurus in a room and ask them to solve
the <a href="http://en.wikipedia.org/wiki/15_puzzle">(n<sup>2</sup> - 1)-puzzle-problem</a>.
</p>

<p>
I wager that the probability of at least one C-guru employing
gratuitous bit-packing for representing the puzzle approaches 1;
whereas it wouldn’t surprise me if at least one Lisper wrote a
reader-macro to do the same thing.
</p>

<p>
Seriously, though; take something like Google’s Grok, which Steve
Yegge describes here as “cross-language source analysis:”
</p>

<blockquote>
<p>
<a href="http://www.youtube.com/watch?v=KTJs-0EInW8">http://www.youtube.com/watch?v=KTJs-0EInW8</a>
</p>
</blockquote>

<p>
They’ve identified certain common language abstractions across C++,
Python, Java, Go, Lisp, etc.; and they scour large codebases, indexing
these abstractions.
</p>

<p>
Taking a look at those statistics gives you a Sapir-Whorf of grammar,
answering the question: “what things do programmers in a given
language prefer to think in?”
</p>

<p>
Answering the question, “what things do programmers in a given
language prefer to think about?”, or a Sapir-Whorf of semantics
(probably a more interesting question), is probably a little more
difficult.
</p>

<p>
One interesting thing would be to do some sort of semantic clustering
on GitHub projects, where Github also keeps language statistics; and
see if there are any interesting interaction.
</p>

<p>
SourceForge also used to maintain a software-map based on Trove, if I
remember correctly; which could also be correlated with language.
</p>
</div>
</body>
</html>
